#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
null_resource.main: Refreshing state... [id=1821907642158083924]
aws_iam_policy.cognito_pre_signup_policy: Refreshing state... [id=arn:aws:iam::522341695260:policy/Cognito_Pre_Signup_Policy]
aws_iam_role.cognito_pre_signup_lambda_role: Refreshing state... [id=Cognito_Pre_Signup_Email_Check_Lambda_Role]
aws_iam_role_policy_attachment.attach_iam_policy_to_iam_role: Refreshing state... [id=Cognito_Pre_Signup_Email_Check_Lambda_Role-20230516210222342700000001]
aws_lambda_function.terraform_lambda_func: Refreshing state... [id=Cognito_Unique_Email_Lambda]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.archive_file.create_pre_signup_email_check_archive_file will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "create_pre_signup_email_check_archive_file" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "./.archive_files/pre_signup_lambda.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "preSignupLambda/"
      + type                = "zip"
    }

  # aws_lambda_function.terraform_lambda_func will be updated in-place
  ~ resource "aws_lambda_function" "terraform_lambda_func" {
        id                             = "Cognito_Unique_Email_Lambda"
      ~ last_modified                  = "2023-05-16T23:37:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "XNQLrDXC4nZv8qp8WgMdoPrHrCizUeiREifWPcAAXCA=" -> (known after apply)
        tags                           = {}
      ~ timeout                        = 30 -> 20
        # (19 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # null_resource.main must be replaced
-/+ resource "null_resource" "main" {
      ~ id       = "1821907642158083924" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "updated_at" = "2023-05-16T23:37:18Z" -> (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>
*Pushed by: @juniorhamish, Action: `pull_request`*